Repository: CAST-projects/ReportGenerator
Catalog: CastReporting.UI.WPF.V2/Resources/Languages/Messages.*.resx
Languages: de_de, es_es, fr_fr, it_it, zh_cn

# btnActiveWS
source: Active
de_de: Aktiv
es_es: Activar
fr_fr: Activer
it_it: Attiva
zh_cn: 激活

# btnAddWS
source: Validate
de_de: Validieren
es_es: Validar
fr_fr: Valider
it_it: Accedi
zh_cn: 验证

# btnDeleteWS
source: Delete
de_de: Löschen
es_es: Borrar
fr_fr: Supprimer
it_it: Cancella
zh_cn: 删除

# btnGenerateReport
source: Generate Report
de_de: Report erzeugen
es_es: Generar Informe
fr_fr: Générer un rapport
it_it: Genera il report
zh_cn: 生成报告

# btnPingWS
source: Test
de_de: Testen
fr_fr: Tester
it_it: Prova
zh_cn: 测试

# btnSaveSettings
source: Save
de_de: Speichern
es_es: Guardar
fr_fr: Sauvegarder
it_it: Salva
zh_cn: 保存

# lblAboutCopyright
source: Copyright © CAST
zh_cn: 版权 © CAST

# lblAboutTitle
source: CAST - Report Generator
zh_cn: CAST - 报告生成器

# lblAboutVersion
source: Version {0}
es_es: Versión {0}
it_it: Versione {0}
zh_cn: 版本 {0}

# lblFieldActiveWS
source: Active
de_de: Aktiv
es_es: Activar
fr_fr: Actif
it_it: Attivato
zh_cn: 激活

# lblFieldQualityGood
source: Good quality
de_de: Hohe Qualität
es_es: Calidad Buena
fr_fr: Bonne qualité
it_it: Qualità buona
zh_cn: 高质量

# lblFieldQualityLow
source: Low quality
de_de: Geringe Qualität
es_es: Calidad Baja
fr_fr: Qualité faible
it_it: Qualità bassa
zh_cn: 低质量

# lblFieldQualityMedium
source: Medium quality
de_de: Mittlere Qualität
es_es: Calidad Baja
fr_fr: Qualité satisfaisante
it_it: Qualità media
zh_cn: 中等质量

# lblFieldQualityVeryLow
source: Very low quality
de_de: Sehr geringe Qualität
es_es: Calidad Muy Baja
fr_fr: Qualité très faible
it_it: Qualità molto bassa
zh_cn: 非常低质量

# lblFieldSizeLimitLarge
source: Size limit large
de_de: Grössenbegrenzung gross
es_es: Límite de tamaño mayor
fr_fr: Limite grande
it_it: Limite di dimensione grande
zh_cn: 规模限定大型

# lblFieldSizeLimitMedium
source: Size limit medium
de_de: Grössenbegrenzung mittel
es_es: Límite de tamaño medio
fr_fr: Limite moyenne
it_it: Limite di dimensione media
zh_cn: 规模限定中等

# lblFieldSizeLimitSmall
source: Size limit small
de_de: Grössenbegrenzung klein
es_es: Límite de tamaño menor
fr_fr: Limite petite
it_it: Limite di dimensione piccola
zh_cn: 规模限定小型

# lblFieldUrlWS
source: Web Service
zh_cn: Web 服务

# lblFieldWSLogin
source: User
es_es: Usuario
fr_fr: Utilisateur
zh_cn: 用户

# lblFieldWSPassword
source: Password
de_de: Passwort
fr_fr: Mot de passe
zh_cn: 密码

# lblHeaderApplication
source: Application
de_de: Applikation
es_es: Aplicación
it_it: Applicazione
zh_cn: 应用

# lblHeaderPortfolio
source: Portfolio
es_es: Porfolio
fr_fr: Portefeuille
it_it: Portafoglio
zh_cn: 应用组合

# lblItemEnglish
source: English
de_de: Englisch
fr_fr: Anglais
it_it: Inglese
zh_cn: 英语

# lblItemFrench
source: French
de_de: Französisch
fr_fr: Français
it_it: Francese
zh_cn: 法语

# lblItemSpanish
source: Spanish
de_de: Spanisch
fr_fr: Espagnol
it_it: Spagnolo
zh_cn: 西班牙语

# lblLanguage
source: Language
de_de: Sprache
es_es: Lenguaje
fr_fr: Langue
it_it: Lingua
zh_cn: 语言

# lblPortfolioCategoriesSelection
source: Tag Selection
de_de: Tag-Auswahl
es_es: Selección Tag
fr_fr: Sélection d'un Tag
it_it: Selezione dello Tag
zh_cn: 标签选择

# lblSelectApplication
source: Select application
de_de: Applikation auswählen
es_es: Seleccionar Aplicación
fr_fr: Sélectionner une application
it_it: Seleziona un'applicazione
zh_cn: 选择应用

# lblSelectCurrentSnapshot
source: Select snapshot
de_de: Snapshot auswählen
es_es: Seleccionar snapshot
fr_fr: Sélectionner un snapshot
it_it: Seleziona uno snapshot
zh_cn: 选择快照

# lblSelectPortfolioCategories
source: Select Category
de_de: Kategori auswählen
es_es: Seleccionar Categoria
fr_fr: Sélectionner une catégorie
it_it: Seleziona Categoria
zh_cn: 选择类别

# lblSelectPortfolioTags
source: Select Tag
de_de: Tag auswählen
es_es: Seleccionar Tag
fr_fr: Sélectionner Tag
it_it: Seleziona Tag
zh_cn: 选择标签

# lblSelectPreviousSnapshot
source: Select older snapshot
de_de: Älteren Snapshot auswählen
es_es: Seleccionar Snapshot anterior
fr_fr: Sélectionner un snapshot plus ancien
it_it: Seleziona un vecchio snapshot
zh_cn: 选择旧快照

# lblTemplatePath
source: Path template
de_de: Pfad-Template
es_es: Path plantilla
fr_fr: Répertoire modèle
it_it: Percorso del template
zh_cn: 模板路径

# lblTitleApplicationQuality
source: Application qualities Thresholds (TQI score)
de_de: Schwellwerte für die Applikationsqualität (TQI)
es_es: Umbrales calidad aplicación (TQI)
fr_fr: Définition des seuils pour la qualité de l'application (score du TQI)
it_it: Soglie di qualità dell'applicazione (TQI)
zh_cn: 应用质量阈值(TQI分数)

# lblTitleApplicationSettings
source: Application settings
de_de: Applikationseinstellungen
es_es: Configuración Aplicación
fr_fr: Paramètres d'application
it_it: Impostazioni dell'applicazione
zh_cn: 应用设置

# lblTitleApplicationSize
source: Application sizes Thresholds (number of code lines)
de_de: Schwellwerte für die Applikationsgrösse
es_es: Umbrales de Aplicación
fr_fr: Définition des seuils pour la taille d'une application
it_it: Soglie di dimensione dell'applicazione
zh_cn: 应用规模阈值(代码行数)

# lblTitleMain
source: Report Generator
zh_cn: 报告生成器

# lblTitleManageWS
source: Web Service Configuration
de_de: Webservice-Konfiguration
es_es: Configuración Web Service
fr_fr: Configuration du Web Service
it_it: Configurazione del Web Service
zh_cn: Web 服务配置

# lblTitleMessages
source: Messages
de_de: Meldungen
es_es: Mensajes
it_it: Messaggi
zh_cn: 消息

# lblTitleSettings
source: Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
it_it: Impostazioni
zh_cn: 设置

# lblTitleSnapshotSelection
source: Snapshot selection
de_de: Snapshot-Auswahl
es_es: Selección Snapshot
fr_fr: Sélection d'un snapshot
it_it: Selezione dello snapshot
zh_cn: 快照选择

# lblTitleTemplateSelection
source: Report template selection
de_de: Report-Template auswählen
es_es: Selección plantilla informe
fr_fr: Sélection d'un modèle de document
it_it: Seleziona il template del report
zh_cn: 报告模板选择

# mnuAbout
source: About
de_de: Info
es_es: Acerca de
fr_fr: A propos
zh_cn: 关于

# mnuQuit
source: Quit
de_de: Beenden
es_es: Salir
fr_fr: Quitter
it_it: Esci
zh_cn: 退出

# mnuReporting
source: Home
es_es: Inicio
fr_fr: Accueil
zh_cn: 主页

# mnuSettings
source: Settings
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
it_it: Impostazioni
zh_cn: 设置

# mnuWSConfiguration
source: WebService Configuration
de_de: Webservice-Konfiguration
es_es: Configuración WebService
fr_fr: Configuration du WebService
it_it: Configurazione del Web Service
zh_cn: Web 服务配置

# msgBuildApplicationResult
source: Build result for the application
de_de: Erstellen Sie das Ergebnis für die Anwendung
es_es: Generar resultado para la aplicación
fr_fr: Construction des résultats pour l'application
it_it: Costruisci il risultato per l'applicazione
zh_cn: 应用构建结果

# msgBuildPreviousSnapshotResult
source: Build result for the previous snapshot
de_de: Erstellen Sie das Ergebnis für den vorherigen Snapshot
es_es: Resultado de compilación para la instantánea anterior
fr_fr: Construction des résultats pour le snapshot précédent
it_it: Crea risultato per la precedente istantanea
zh_cn: 上一快照构建结果

# msgBuildSnapshotResult
source: Build result for the selected snapshot
de_de: Erstellen Sie das Ergebnis für den ausgewählten Snapshot
es_es: Resultado de compilación para la instantánea seleccionada
fr_fr: Construction des résultats pour le snapshot sélectionné
it_it: Crea risultato per lo snapshot selezionato
zh_cn: 已选快照构建结果

# msgDocumentGenerationSuccess
source: Report generated successfully !
de_de: Report erfolgreich erzeugt!
es_es: Informe generado con éxito!
fr_fr: Rapport généré avec succès !
it_it: Il report è stato generato correttamente !
zh_cn: 报告生成成功！

# msgErrorGeneratingReport
source: Error Generating Report
de_de: Fehler beim Generieren des Berichts
es_es: Error al generar el informe
fr_fr: Erreur lors de la génération du rapport
it_it: Errore durante la generazione del report
zh_cn: 报告生成报错

# msgGenericError
source: An error occured during execution
de_de: Während der Ausführung ist ein Fehler aufgetreten
es_es: Error durante la ejecución
fr_fr: Une erreur est survenue pendant la génération
it_it: Si è verificato un problema durante l'esecuzione
zh_cn: 执行过程中出错

# msgIgnoredApplications
source: Ignored Applications are:
de_de: Ignorierte Anwendungen sind:
es_es: Las aplicaciones ignoradas son:
fr_fr: Les applications ignorées sont:
it_it: Le applicazioni ignorate sono:
zh_cn: 忽略的应用：

# msgIgnoredAppSnaps
source: Some Applications or Snapshots were ignored during processing REST API.
de_de: Einige Anwendungen oder Snapshots wurden während der Verarbeitung der REST-API ignoriert.
es_es: Algunas aplicaciones o instantáneas se ignoraron durante el procesamiento de la API REST.
fr_fr: Certaines applications ou snapshots ont été ignorés lors du traitement de l'API REST.
it_it: Alcune applicazioni o istantanee sono state ignorate durante l'elaborazione dell'API REST.
zh_cn: 在REST API处理过程中一些应用或快照被忽略。

# msgIgnoredSnapshots
source: Ignored Snapshots are:
de_de: Ignorierte Snapshots sind:
es_es: Las instantáneas ignoradas son:
fr_fr: Les snapshots ignorés sont:
it_it: Le istantanee ignorate sono:
zh_cn: 已忽略快照：

# msgPingServiceFailure
source: Web service invalid !
de_de: Webservice ungültig!
es_es: Web service no valido !
fr_fr: Web service non valide !
it_it: Web service invalido !
zh_cn: Web 服务无效！

# msgPingServiceSuccess
source: Web service valid !
de_de: Webservice gültig!
es_es: Web service valido !
fr_fr: Web service valide !
it_it: Web service valido !
zh_cn: Web 服务生效！

# msgReportErrorNoAAD
source: Typically happens when Portfolio report is generated based on a REST API not connected to measure schema.
de_de: Dies ist in der Regel der Fall, wenn der Portfolio-Bericht basierend auf einer REST-API generiert wird, die nicht mit dem Kennzahlenschema verbunden ist.
es_es: Normalmente sucede cuando el informe de cartera se genera en función de una API REST no conectada para medir el esquema.
fr_fr: Cela se produit généralement lorsque le rapport Portfolio est généré sur la base d'une API REST non connectée au schéma de mesure.
it_it: Generalmente accade quando il report Portfolio viene generato in base a un'API REST non connessa allo schema measure.
zh_cn: 组合应用的报告未生成可能发生的原因是未连接到Measure数据库。

# msgReportErrorNoRestAPI
source: Typically happens when Report Generator does not find REST API
de_de: In der Regel, wenn der Report Generator die REST-API nicht findet
es_es: Suele pasar cuando Report Generator no encuentra la API REST
fr_fr: Se produit généralement lorsque Report Generator ne trouve pas l'API REST.
it_it: Generalmente accade quando Generatore report non trova l'API REST
zh_cn: 可能发生原因是报告生成器没有找到REST API

# msgReportGenerated
source: Report generated
de_de: Bericht generiert
es_es: Informe generado
fr_fr: Rapport généré.
it_it: Rapporto generato
zh_cn: 已生成报告

# msgReportGenerationSuccess
source: Generation proceeded successfully. Click below to see the report :
de_de: Report-Erzeugung erfolgreich. Hier klicken um den Report zu öffnen:
es_es: La generación procedió con éxito. Haga clic abajo para ver el informe:
fr_fr: Génération réalisée avec succès. Cliquer ci-dessous pour ouvrir le document généré :
it_it: Generazione conclusa correttamente. Clicca sotto per vedere il report:
zh_cn: 生成处理成功执行。点击下面查看具体报告：

# msgServiceActivated
source: Web Service URL activated successfully !
de_de: Webservice-URL wurde erfolgreich aktiviert!
es_es: Web Service URL activada con éxito !
fr_fr: L'url du Web Service est activée avec succès !
it_it: L'URL del Web Service è stato attivato con successo !
zh_cn: Web 服务 URL激活成功！

# msgServiceActivatedAddedOK
source: Web Service URL added and activated successfully !
de_de: Webservice-URL erfolgreich hinzugefügt und aktiviert!
es_es: Web Service URL añadida y activada con éxito !
fr_fr: L'url du Web Service a été ajouté et validé avec succès !
it_it: L'URL del Web Service è stato aggiunto e attivato con successo !
zh_cn: 已添加Web 服务 URL并激活成功！

# msgServiceAddedAlreadyExist
source: This Web Service URL already exist.
de_de: Diese Webservice-URL existiert bereits.
es_es: Esta URl de Web Service URL ya existe.
fr_fr: Cette url de Web Service existe déjà.
it_it: Questo URL del Web Service esiste già.
zh_cn: Web 服务URL已存在。

# msgServiceAddedFailed
source: Unable to add this Web Service URL. Please enter a valid url as http://<server>:<port>/<war>/rest and valid login/password
de_de: Diese Webservice-URL kann nicht hinzugefügt werden. Bitte geben Sie eine gültige URL wie folgt ein: http://<server>:<port>/<war>/rest and valid login/password
es_es: No se puede añadir esta URL de Web Service. Por favor, introduzca una valida como http://<server>:<port>/<war>/rest y un usuario/password válido
fr_fr: Impossible d'ajouter cette url de Web Service. Veuillez saisir une url valide au format suivant http://<server>:<port>/<war>/rest et valider l'utilisateur/mot de passe
it_it: Impossibile aggiungere questo URL del Web Service. Inserisci un URL valido come http://<server>:<port>/<war>/rest e una coppia login/password valida
zh_cn: 无法添加Web服务URL。请输入有效的URL地址，如 http://<server>:<port>/<war>/rest 和 用户名/密码

# msgServiceAddedOK
source: Web Service URL added successfully !
de_de: Webservice-URL wurde erfolgreich hinzugefügt!
es_es: Web Service URL añadida con éxito !
fr_fr: L'url du Web Service est ajoutée avec succès !
it_it: L'URL del Web Service è stato aggiunto con successo !
zh_cn: 成功添加Web服务URL！

# msgServiceRemoved
source: Web Service URL removed successfully !
de_de: Webservice-URL erfolgreich entfernt!
es_es: Web Service URL eliminada con éxito !
fr_fr: L'url du Web Service est effacée avec succès
it_it: L'URL del Web Service URL è stato rimosso con successo !
zh_cn: 成功删除Web服务URL！

# msgSettingsSaved
source: Settings saved
de_de: Einstellungen gespeichert
es_es: Configuración guardada
fr_fr: Configuration sauvegardée
it_it: Impostazioni salvate
zh_cn: 设置已保存

# msgWSError
source: Error occurred during web service requesting
de_de: Während der Webservice-Anforderung ist ein Fehler aufgetreten
es_es: Error durante la petición al web service
fr_fr: Une erreur est survenue pendant le requêtage du Web Service
it_it: Si è verificato un errore durante la richiesta al web service
zh_cn: web服务请求出错

# toolTipClearMsg
source: Clear messages.
de_de: Meldungen entfernen.
es_es: Eliminar mensajes.
fr_fr: Effacer les messages.
it_it: Cancella messaggi.
zh_cn: 清除消息。

# toolTipOpenDirectory
source: Open Directory.
de_de: Verzeichnis öffnen.
es_es: Abrir Directorio.
fr_fr: Ouvrir le répertoire.
it_it: Apri directory.
zh_cn: 打开目录。

# toolTipRefreshTemplate
source: Refresh the template list.
de_de: Template-Liste aktualisieren.
es_es: Refrecar lista de plantillas.
fr_fr: Rafraîchir la liste des modèles de document.
it_it: Ricarica la lista dei template.
zh_cn: 刷新模板列表。

# toolTipTemplateLb
source: You can double click on any template to open the related file. Therefore, you will be able to edit the template.
de_de: Sie können jedes der Templates doppelklicken, um es zu editieren.
es_es: Haga doble clic en cualquiera de las plantillas para abrir el archivo relacionado y editarlo.
fr_fr: Vous pouvez double cliquer sur les modèles pour les ouvrir. Vous pourrez alors les modifier.
it_it: Fai doppio click su un qualsiasi template per aprirne il file relativo. Dopodichè sarai in grado di modificarlo.
zh_cn: 可以双击任何模板打开相关文件。然后，就可以编辑修改模板。

# toolTipUrlWs
source: Please enter a valid WebService url as http://<server>:<port>/<war>/rest
de_de: Bitte geben Sie eine gültige Webservice-URL wie folgt ein: http://<server>:<port>/<war>/rest
es_es: Por favor, introduzca una url del Webservice válida como http://<server>:<port>/<war>/rest
fr_fr: Veuillez saisir une url de Web Service valide au format suivant : http://<server>:<port>/<war>/rest
it_it: Inserisci un URL di un WebService valido, come http://<server>:<port>/<war>/rest
zh_cn: 请输入有效的Web服务 URL地址，如 http://<server>:<port>/<war>/rest

# msgBuildPortfolioResults
source: Build result for the portfolio
de_de: Build Ergebnis für das Portfolio
es_es: Generar resultados para la cartera
fr_fr: Construction des résultats pour le portfolio
it_it: Costruisci il risultato per il portafoglio
zh_cn: 应用组合构建结果

# msgBuildPortfSnapshotsResults
source: Build result for snapshots in portfolio
de_de: Erstellen Sie das Ergebnis für Snapshots im Portfolio
es_es: Generar resultados para instantáneas en cartera
fr_fr: Construction des résultats pour les snapshots du portfolio
it_it: Crea risultati per istantanee in portfolio
zh_cn: 应用组合快照构建结果

# msgServiceShouldBeRevalidated
source: Please revalidate your web service connection, it seems you are no more connected.
de_de: Bitte validieren Sie Ihre Webdienst-Verbindung erneut. Sie scheinen nicht mehr verbunden zu sein.
es_es: Vuelva a validar la conexión de su servicio web, parece que ya no está conectado.
fr_fr: Veuillez revalider votre connexion au service Web, il semble que vous ne soyez plus connecté.
it_it: Per favore riconvalida la tua connessione al servizio web, sembra che tu non sia più connesso.
zh_cn: 请重新验证您的网络服务连接，似乎您已经断开连接
