Repository: CAST-projects/ReportGenerator
Catalog: CastReporting.Reporting.Core/Languages/Labels.*.resx
Languages: es_es, fr_fr, it_it

source: Robustness
es_es: Robustez
fr_fr: Robustesse
it_it: Robustezza

source: Efficiency
es_es: Eficiencia
fr_fr: Performance
it_it: Efficienza

source: Changeability
es_es: Facilidad de Cambio
fr_fr: Evolutivité
it_it: Modificabilità

source: Transferability
es_es: Transferibilidad
fr_fr: Transférabilité
it_it: Trasferibilità

source: Security
es_es: Seguridad
fr_fr: Sécurité
it_it: Sicurezza

# AutomatedFP
source: Automated Function Points
es_es: Puntos Función Automatizados
fr_fr: Points de fonction automatisés (AFP)

# BackfiredFP
source: Backfired Function Points
es_es: Puntos Función Backfired
fr_fr: Points de fonction Backfired

# DecisionP
source: Decision Points (total CC)
es_es: Puntos de Decisión (total CC)
fr_fr: Points de décision (CC totale)
it_it: Punti di Decisione (totali)

source: Chang.
es_es: Camb.
fr_fr: Evol.
it_it: Modif.

source: Secu.
es_es: Segu.
fr_fr: Sécu.
it_it: Sicu.

source: Efcy
es_es: Efi
fr_fr: Perf.
it_it: Effic.

source: Variation
es_es: Variación
it_it: Variazione

source: Name
es_es: Nombre
fr_fr: Nom
it_it: Nome

source: Rule
es_es: Regla
fr_fr: Règle
it_it: Regola

# ViolationsStill
source: Still Violations (#)
es_es: Violaciones Existentes (#)
fr_fr: Non-conformités reportées
it_it: Violazioni Rimanenti (#)

# ViolationsNew
source: New Violations (#)
es_es: Violaciones Nuevas (#)
fr_fr: Non-conformités nouvelles
it_it: Nuove Violazioni (#)

# ViolationsCritical
source: Critical Violations
es_es: Violaciones Críticas
fr_fr: Non-conformités critiques
it_it: Violazioni Critiche

source: Current
es_es: Actual
fr_fr: Actuel
it_it: Attuale

source: Previous score
es_es: Score anterior
fr_fr: Score précédent
it_it: Score precedente

# NoItem
source: No enabled item
es_es: Item no habilitado
fr_fr: Aucun élément
it_it: Nessun item abilitato

source: Evolution
es_es: Evolución
it_it: Evoluzione

# EvolutionPercent
source: % Evolution
es_es: % Evolución
it_it: % Evoluzione

# ComplexityLow
source: Low Complexity
es_es: Complejidad Baja
fr_fr: Complexité faible
it_it: Complessità bassa

# ComplexityAverage
source: Average Complexity
es_es: Complejidad Media
fr_fr: Complexité moyenne
it_it: Complessità media

# ComplexityVeryHigh
source: Very High Complexity
es_es: Complejidad Muy Alta
fr_fr: Complexité très élevée
it_it: Complessità molto alta

# ComplexityHigh
source: High Complexity
es_es: Complejidad Alta
fr_fr: Complexité élevée
it_it: Complessità elevata

# CplxAverage
source: Average
es_es: Media
fr_fr: Moyenne
it_it: Media

# CplxExtreme
source: Extreme
es_es: Extrema
fr_fr: Extrême
it_it: Estrema

# CplxLow
source: Low
es_es: Baja
fr_fr: Faible
it_it: Bassa

# CplxHigh
source: High
es_es: Alta
fr_fr: Elevée
it_it: Alta

source: Artifacts
es_es: Artefactos
fr_fr: Artéfacts
it_it: Artefatti

# Complexity
source: CAST Complexity
es_es: Complejidad de CAST
fr_fr: Complexité CAST
it_it: Complessità CAST

# ComplexityExtreme
source: Extreme Complexity
es_es: Complejidad Extrema
fr_fr: Complexité extreme
it_it: Complessità estrema

# ComplexityHighAndVeryHigh
source: High and Very High Complexity
es_es: Complejidad Alta y Muy Alta
fr_fr: Complexité élevée et très élevée
it_it: Complessità alta e molto alta

# VersionCurrent
source: Current Version
es_es: Versión Actual
fr_fr: Version actuelle
it_it: Versione Attuale

# VersionPrevious
source: Previous Version
es_es: Versión Previa
fr_fr: Version précédente
it_it: Versione Precedente

# ViolationsRemoved
source: Removed
es_es: Eliminadas
fr_fr: Non-conformités supprimées
it_it: Rimosse

# ViolationsAdded
source: Added
es_es: Añadidas
fr_fr: Non-conformités ajoutées
it_it: Aggiunte

source: Snapshot Label
es_es: Etiqueta de la Instantánea
fr_fr: Libellé du snapshot
it_it: Etichetta Snapshot

source: Snapshot Date
es_es: Fecha de la Instantánea
fr_fr: Date du snapshot
it_it: Data Snapshot

# FORMAT_LONG_DATE
source: MMM dd yyyy
es_es: dd \d\e MMM \d\e yyyy
fr_fr: dd MMM yyyy

source: Module Name
es_es: Nombre del Módulo
fr_fr: Nom du module
it_it: Nome Modulo

source: Rule Name
es_es: Nombre de la Regla
fr_fr: Nom de la règle
it_it: Nome Regola

# ViolationsCurrent
source: Current Violations
es_es: Violaciones Actuales
fr_fr: Non-conformités actuelles
it_it: Violazioni Attuali

# ViolationsPrevious
source: Previous Violations
es_es: Violaciones Anteriores
fr_fr: Non-conformités précédentes
it_it: Violazioni Precedenti

source: Grade
es_es: Nota
fr_fr: Indic.

source: Grade Evolution
es_es: Evolución de la Nota
fr_fr: Evol. indic.
it_it: Evoluzione Grade

# ViolationsCount
source: # Violations
es_es: # Violaciones
fr_fr: Nb de non-conformités
it_it: # Violazioni

source: Value
es_es: Valor
it_it: Valore

source: Tables
es_es: Tablas
it_it: Tabelle

source: Files
es_es: Ficheros
fr_fr: Fichiers
it_it: File

source: Classes
es_es: Clases
it_it: Classi

# LoCCurrent
source: Current LoC
es_es: LoC Actual
fr_fr: LoC actuel
it_it: LoC Attuali

# LoCPrevious
source: Previous LoC
es_es: LoC Anterior
fr_fr: LoC précédent
it_it: LoC Precedenti

# TransactionEP
source: Transaction Entry Point
es_es: Punto de Entrada de Transacciones
fr_fr: Points d'entrée de transaction

source: Artifact Name
es_es: Nombre del Artefactos
fr_fr: Nom de l'artéfact
it_it: Nome Artefatto

source: Statistics
es_es: Estadísticas
fr_fr: Statistiques
it_it: Statistiche

source: Arch.
es_es: Arq.

source: Rationale
es_es: Justificación
fr_fr: Raisons
it_it: Razionale

source: Description
es_es: Descripción
it_it: Descrizione

source: Remediation
es_es: Remediación
fr_fr: Remédiation
it_it: Rimedio

# TQICur
source: Cur. TQI
es_es: TQI Actu.
fr_fr: TQI act.
it_it: TQI att.

# TQIPrev
source: Prev. TQI
es_es: TQI Ant.
fr_fr: TQI préc.
it_it: TQI prec.

# TQIPrevious
source: Previous TQI
es_es: TQI Anterior
fr_fr: TQI précédent
it_it: TQI precedente

# TQICurrent
source: Current TQI
es_es: TQI Actual
fr_fr: TQI actuel
it_it: TQI attuale

source: Techno
es_es: Tecno

source: Architectural Design
es_es: Diseño de Arquitectura
fr_fr: Conception architecturelle

source: Documentation
es_es: Documentación
it_it: Documentazione

source: Programming Practices
es_es: Prácticas de Programación
fr_fr: Pratiques de programmation

source: SEI Maintainability
es_es: Mantenibilidad SEI
fr_fr: Maintenabilité SEI
it_it: Manutenibilità SEI

source: per File
es_es: por Fichero
fr_fr: par fichier

source: per kLoC
es_es: por kLoC
fr_fr: par kLoC

source: Complex Objects
es_es: Objetos Complejos
fr_fr: Objets complexes
it_it: Oggetti Complessi

source: With Violations
es_es: Con Violaciones
fr_fr: Avec non-conformités
it_it: Con Violazioni

source: Debt
es_es: Deuda
fr_fr: Dette
it_it: Debito

source: Debt Added
es_es: Deuda Añadida
fr_fr: Dette ajoutée
it_it: Debito aggiunto

source: Debt Removed
es_es: Deuda Eliminada
fr_fr: Dette supprimée
it_it: Debito Rimosso

source: Technical Debt
es_es: Deuda Técnica
fr_fr: Dette technique
it_it: Debito Tecnico

source: Technical Debt Added
es_es: Deuda Técnica Añadida
fr_fr: Dette technique ajoutée
it_it: Debito Tecnico Aggiunto

source: Technical Debt Removed
es_es: Deuda Técnica Eliminada
fr_fr: Dette technique supprimée
it_it: Debito Tecnico rimosso

source: Total Checks
es_es: Verificaciones Totales
fr_fr: Nombre total
it_it: Totale controllati

source: Technical criterion name
es_es: Nombre del Criterio Técnico
fr_fr: Nom du critère technique
it_it: Nome criterio tecnico

source: Total Failed
es_es: Número de Violaciones
fr_fr: Nombre d'échecs
it_it: Numero di violazioni

# TotalOk
source: Successful Checks
es_es: Verificaciones con éxito
fr_fr: Contrôles réussis
it_it: Totale corretti

source: Technical Criterion
es_es: Criterio Técnico
fr_fr: Critère technique
it_it: Criterio Tecnico

source: Weight
es_es: Peso
fr_fr: Poids
it_it: Peso

source: Objectives
es_es: Objetivos
fr_fr: Objectifs
it_it: Obbiettivi

source: Achievement
es_es: Consecución
fr_fr: Atteinte

source: Achievement ratio
es_es: Porcentaje de Consecución
fr_fr: Ratio d'atteinte

source: Achiev.
es_es: Consec.
fr_fr: Atteinte

# DeliveryWhole
source: Entire Application (whole code)
es_es: Aplicación completa (código completo)
fr_fr: Application complète (tout le code)
it_it: Intera Applicazione (tutto il codice)

# DeliveryLast
source: Last Delivery (new and modified)
es_es: Entrega última (nueva y modificada)
fr_fr: Dernière livraison (nouveau et modifié)
it_it: Ultima Delivery (nuovi e modificati)

# Size
source: Size (kLoC)
es_es: Tamaño (kLoC)
fr_fr: Taille (kLoC)
it_it: Dimensione (kLoC)

# CplxVeryHigh
source: Very High
es_es: Muy alta
fr_fr: Très élevée
it_it: Molto Alta

# QualityVeryLow
source: very low
es_es: muy baja
fr_fr: très faible
it_it: molto bassa

# QualityLow
source: low
es_es: baja
fr_fr: faible
it_it: bassa

# QualityMedium
source: medium
es_es: media
fr_fr: moyenne
it_it: media

# QualityGood
source: good
es_es: buena
fr_fr: bonne
it_it: buona

# QualityVeryGood
source: very good
es_es: muy buena
fr_fr: très bonne
it_it: molto buona

# SizeS
source: small
es_es: pequeña
fr_fr: petite
it_it: piccola

# SizeM
source: medium
es_es: mediana
fr_fr: moyenne
it_it: media

# SizeL
source: large
es_es: grande
fr_fr: grande
it_it: grande

# SizeXL
source: extra large
es_es: muy grande
fr_fr: très grande

source: Criticality
es_es: Criticidad
fr_fr: Criticité
it_it: Criticità

# FORMAT_SHORT_DATE
source: MM/dd/yyyy
es_es: dd/MM/yyyy
fr_fr: dd/MM/yyyy

source: Application
es_es: Aplicación
it_it: Applicazione

# Target
source: Target score
es_es: Score objetivo
fr_fr: Score cible
it_it: Score bersaglio

source: Current score
es_es: Score actual
fr_fr: Score actuel
it_it: Score attuale

source: SLA Violations
es_es: Violaciones SLA
fr_fr: Non-conformités SLA
it_it: Violazioni SLA

source: Acceptable
es_es: aceptable
it_it: accettabile

# Bad
source: Poor
es_es: pobre
fr_fr: mauvais
it_it: povero

source: Business criterion name
es_es: Nombre del Criterio Negocio
fr_fr: Nom du critère mètier
it_it: Nome criterio affari

source: Good
es_es: bueno
fr_fr: bon
it_it: buona

source: Critical
es_es: Crítico
fr_fr: Critique
it_it: Critico

source: Compliance
es_es: Conformidad
fr_fr: Conformité
it_it: Conformità

# NoData
source: No data found
es_es: Datos no encontrados
fr_fr: Aucune donnée disponible
it_it: Nessun dato trovato

# NoSnapshot
source: No snapshot found for this application
es_es: No se ha encontrado ninguna instantánea para esta aplicación
fr_fr: Pas de snapshot trouvé pour cette application
it_it: Nessun snapshot trovato per questa applicazione

source: Object Name
es_es: Nombre del objeto
fr_fr: Nom de l'objet
it_it: Nome dell'oggetto

source: Technology
es_es: Technologia
fr_fr: Technologie
it_it: Tecnologia

source: Added Critical Violations
es_es: Violaciones Críticas Añadidas
fr_fr: Non-conformités critiques ajoutées
it_it: Violazioni critiche aggiunte

source: Added Violations
es_es: Violaciones Añadidas
fr_fr: Non-conformités ajoutées
it_it: Violazioni aggiunte

source: Removed Critical Violations
es_es: Violaciones Críticas Eliminadas
fr_fr: Non-conformités critiques supprimées
it_it: Violazioni critiche rimosse

source: Removed Violations
es_es: Violaciones Eliminadas
fr_fr: Non-conformités supprimées
it_it: Violazioni rimosse

source: Total Critical Violations
es_es: Violaciones Críticas Totales
fr_fr: Non-conformités critiques
it_it: Violazioni critiche totali

source: Total Violations
es_es: Violaciones Totales
fr_fr: Non-conformités
it_it: Violazioni totali

source: Metrics
es_es: Métricas
fr_fr: Métriques
it_it: Metriche

source: Modules
es_es: Módulos
it_it: Moduli

source: Snapshots
es_es: Instantáneas

source: Technologies
es_es: Tecnologías
it_it: Tecnologie

source: Violations
es_es: Violaciones
fr_fr: Non-conformités
it_it: Violazioni

source: Previous
es_es: Anterior
fr_fr: Précédent
it_it: Precedente

source: Status
es_es: Estado
it_it: Stato

source: Objects in violation for rule
es_es: Los objetos en violación a la regla
fr_fr: Objets en violation pour la règle
it_it: Oggetti in violazione alla regola

source: Periods
es_es: Periodos
fr_fr: Périodes
it_it: Periodi

source: Applications
es_es: Aplicaciones
it_it: Applicazioni

source: Current Period
es_es: Período actual
fr_fr: Période actuelle
it_it: Periodo attuale

source: Previous Period
es_es: Periodo anterior
fr_fr: Période précédente
it_it: Periodo precedente

source: Comment
es_es: Comentario
fr_fr: Commentaire
it_it: Commento

source: Last Updated
es_es: Última actualización
fr_fr: Dernière modification
it_it: Ultimo aggiornamento

source: Priority
es_es: Prioridad
fr_fr: Priorité
it_it: Priorità

source: Action Status
es_es: Estado de acción
fr_fr: Status de l'action
it_it: Stato dell'azione

source: Exclusion Status
es_es: Estado de exclusión
fr_fr: Status de l'exclusion
it_it: Stato di esclusione

source: Object Status
es_es: Estado del objeto
fr_fr: Status de l'objet
it_it: Stato dell'oggetto

source: Violation Status
es_es: Estado de violación
fr_fr: Statut de violation
it_it: Stato di violazione

source: File path
es_es: Ruta de archivo
fr_fr: Chemin du fichier
it_it: Percorso del file

# NoBookmark
source: No bookmark available for this rule
es_es: No hay marcador disponible para esta regla
fr_fr: Pas de bookmark disponible pour cette règle
it_it: Nessun segnalibro disponibile per questa regola

# AdditionalInformation
source: Additional information bookmark
es_es: Marcador de información adicional
fr_fr: Information supplémentaire sur le défaut
it_it: Ulteriori informazioni segnalibro

source: Defect
es_es: Defecto
fr_fr: Défaut
it_it: Difetto

source: Violation
es_es: Violación
fr_fr: Non-conformité
it_it: Violazione

source: Violation Path
es_es: Camino de Violación
fr_fr: Chemin de violation
it_it: Percorso di violazione

# ComplianceScorePercent
source: Compliance Score (%)
es_es: Puntaje de cumplimiento (%)
fr_fr: Score de conformité (%)
it_it: Punteggio di conformità (%)

source: No violation
es_es: Sin violación
fr_fr: Aucune violation
it_it: Nessuna violazione

source: Added Vulnerabilities
es_es: Vulnerabilidades Añadidas
fr_fr: Vulnerabilités ajoutées
it_it: Aggiunto Vulnerabilità

source: Removed Vulnerabilities
es_es: Vulnerabilidades Eliminadas
fr_fr: Vulnerabilités supprimées
it_it: Vulnerabilità Rimosse

source: Total Vulnerabilities
es_es: Vulnerabilidades Totales
fr_fr: Vulnerabilités
it_it: Vulnerabilità totali

source: CAST Rules
es_es: Reglas CAST
fr_fr: Règles CAST
it_it: Regole CAST

# PropertiesNotAvailable
source: Properties are not available. Only following properties are available :
es_es: Las propiedades no están disponibles. Sólo las siguientes propiedades están disponibles:
fr_fr: Les propriétés ne sont pas disponibles. Seules les propriétés suivantes sont disponibles:
it_it: Le proprietà non sono disponibili. Sono disponibili solo le seguenti proprietà:

# NoRules
source: No applicable rules for given application
es_es: No hay reglas aplicables para la aplicación seleccionada
fr_fr: Aucune règle applicable pour l'application sélectionnée
it_it: Nessuna regola applicabile per l'applicazione selezionata

source: Complexity Factor
es_es: Factor de complejidad
fr_fr: Facteur de complexité
it_it: Fattore di complessità

source: Function Name
es_es: Nombre de la función
fr_fr: Nom de la fonction
it_it: Nome della funzione

source: Updated Artifacts
es_es: Artefactos actualizados
fr_fr: Artéfacts mis à jour
it_it: Artefatti aggiornati

# Complexity1
source: Complexity
es_es: Complejidad
fr_fr: Complexité
it_it: Complessità

# Coupling1
source: Coupling
es_es: Acoplamiento
fr_fr: Couplage
it_it: Accoppiamento

source: Granularity
es_es: Granularidad
fr_fr: Granularité
it_it: Granularità

source: Lack of comments
es_es: Falta de comentarios
fr_fr: Manque de commentaires
it_it: Mancanza di commenti

source: Number of object updates
es_es: Número de actualizaciones de objetos
fr_fr: Nombre de mises à jour de l'objet
it_it: Numero di aggiornamenti dell'oggetto

source: Object full name
es_es: Nombre completo del objeto
fr_fr: Nom complet de l'objet
it_it: Nome completo dell'oggetto

source: SQL Complexity
es_es: Complejidad de SQL
fr_fr: Complexité SQL
it_it: Complessità SQL

# ModuleNotFound
source: Module not found in this application.
es_es: Módulo no encontrado en esta aplicación.
fr_fr: Module introuvable dans cette application.
it_it: Modulo non trovato in questa applicazione.

# NoPreviousSnapshot
source: Previous snapshot was not found.
es_es: No se encontró la snapshot anterior
fr_fr: Le précédent snapshot n'a pas été trouvé.
it_it: Le snapshot precedente non è stata trovata

# StatusNotAllowed
source: Selected status not allowed. Allowed status are : added, deleted or updated.
es_es: Estado seleccionado no permitido. Los estados permitidos son: added, deleted o updated.
fr_fr: Statut sélectionné non autorisé. Les statuts autorisés sont: added, deleted ou updated.
it_it: Stato selezionato non consentito. Lo stato consentito è: added, deleted o updated.

# TechnoNotFound
source: Technology not found in this application.
es_es: La tecnología no se encuentra en esta aplicación.
fr_fr: Technologie introuvable dans cette application.
it_it: Tecnologia non trovata in questa applicazione.

source: Effort complexity
es_es: Esfuerzo complejidad
fr_fr: Effort de complexité
it_it: Sforzo della complessità

source: Equivalence ratio
es_es: Relación de equivalencia
fr_fr: Ratio d'équivalence
it_it: Rapporto di equivalenza

# SnapshotNotTheLatestOne
source: Current snapshot is not the latest one. No data can be displayed.
es_es: La snapshot actual no es la más reciente. No se pueden mostrar datos.
fr_fr: Le snapshot courant n'est pas le dernier. Aucune donnée ne peut être affichée.
it_it: Le snapshot corrente non è l'ultima. Nessun dato può essere visualizzato.

source: Total
it_it: Totale

# TotalPercent
source: % Total
it_it: % Totale

# ArtifactsSQL
source: SQL Art.
fr_fr: Art. SQL
it_it: Artefatti SQL

source: Obj.
it_it: Obb.

# ViolCount
source: # Viol.
fr_fr: Nb. non-conf.
